from collections import UserString

template = [
    "Ви можете досягти всього. Варто лише трохи постаратися і запастися книгами.",
    "Цей смартфон - справжня знахідка. Великий і яскравий екран, потужний процесор - все це в невеликому гаджеті.",
    "Зібрати камені нескінченності легко, якщо ви природжений герой.",
    "Освоїти верстку нескладно. Візьміть книгу нову книгу і закріпіть усі вправи на практиці.",
    "Боротися з прокрастинацією нескладно. Просто дійте. Маленькими кроками.",
    "Програмувати не настільки складно, як про це говорять.",
    "Прості щоденні вправи допоможуть досягти успіху."
]


# for item, text in enumerate(template):
#     print("|{:^5}|{:<15}".format(item, text))

class Text(UserString):
    def set_limit_text(self, limit=15):
        return (f'{self.data[:limit]}...')


text = [Text(text) for text in template]
for item, text in enumerate(text):
    print("|{:^5}|{:<15}".format(item, text.set_limit_text(35)))
