"""Дуже часто люди у своїх повідомленнях не ставлять великі літери, особливо це стало масовим явищем в еру мобільних. пристроїв. Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом і повертатиме рядок з відновленими великими літерами.

Функція повинна:

зробити великою першу літеру в рядку, попри прогалини
зробити великою першу літеру після точки, попри прогалини
зробити великою першу літеру після знака оклику, попри прогалини
зробити великою першу літеру після знака питання, попри прогалини"""


def capital_text(text):
    # Перевірка на порожній рядок
    if not text:
        return text
    # Зробимо великою першу літеру в рядку а останні маленькімі...
    text = text.lower().capitalize()
    # задаємо початковий стан для слова, що має пунктуацію
    is__word_with_punctuation = False
    # Ініціалізація пустого рядка для результату
    result = ""
    # Перетворення рядка на список слів
    words = text.split()
    for i, word in enumerate(words):
        # Знаки пунктуації, які потрібно перевіряти
        punctuation = ".!?"
        # Якщо слово було з пунктуаціею, зробимо першу літеру велікою
        if  is__word_with_punctuation:
            word = word.capitalize()
            is__word_with_punctuation = False
        # Якщо слово містить знак пунктуації, міняемо його стан.
        if word[-1] in punctuation:
            is__word_with_punctuation = True
        # Додаємо слово до результату зі знаком пунктуації (якщо він є)
        result += word
        # Додаємо пробіл, якщо це не останнє слово
        if i < (len(words) - 1):
            result += " "

    return result

# Приклад використання:
text = "hello. how are you! i'm fine, thank you?"
capitalized_text = capital_text(text)
print(capitalized_text)