"""При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі. Напишіть функцію data_preparation, яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

Функція повинна видаляти з переданих списків найбільше і найменше значення, але якщо розмір списку понад два елементи. Після видалення даних з кожного списку необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути отриманий список як результат (Для прикладу вище результат буде наступним: [6, 5, 4, 3, 2])."""

def data_preparation(list_data):
    result = []
    for data in list_data:
        if len(data) > 2:
            data.remove(min(data))
            data.remove(max(data))
        result.extend(data)
    print(result)
    result.sort(reverse=True)
    return result


print(data_preparation([[1,2,3],[3,4], [5,6]]))
